* 移除数组中给定的元素

** 题目描述
给定一个数组 移除给定的元素ele
返回最后的元素个数

** 双指针技术
使用两个指针进行扫描
最后返回慢指针的位置

#+begin_src python
class Solution:
    def removeElement(self, arr, ele):
        n = len(arr)
        start = None
        k = 0
        for i in range(n):
            if arr[i] == ele:
                if not start:
                    start = i
            else:
                k += 1
                if start is not None:
                    arr[start], arr[i] = arr[i], arr[start]
                    start = i

        return k


return Solution().removeElement([0, 1, 3, 0, 2, 2, 4, 2], 4)
#+end_src

#+RESULTS:
: 7
